CollegeInventory/Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабДокОснСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Имущество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеНаличие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабДокИнвентКомиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленыКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Председатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CollegeInventory/InformationRegisters/УчетДвиженийИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УчетДвиженийИмущества</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Состояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Имущество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CollegeInventory/Enums/Состояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Состояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поврежденное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списанное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утеряно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CollegeInventory/Catalogs/Имущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Имущество</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииИмущества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриобретения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПоДаннымУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CollegeInventory/Documents/Инвентаризация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновлениеИнформации()
	Объект.ТабДокОснСредства.Очистить();   
	МассивДанных = ПолучитьЗаписиРегистра(Объект.Помещение);
	Для Каждого Стр Из МассивДанных Цикл 
		СтрокаТЧ = Объект.ТабДокОснСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = Стр.ОсновноеСредство;
		СтрокаТЧ.ИнвНомер = Стр.ИнвНомер;
		СтрокаТЧ.Стоимость = Стр.Стоимость;
		СтрокаТЧ.Состояние = Стр.Состояние;    
		СтрокаТЧ.НаличиеПоДаннымУчета = Стр.НаличиеПоДаннымУчета;
	КонецЦикла;
КонецПроцедуры  

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	ОбновлениеИнформации();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаписиРегистра(Помещение)
	Запрос = Новый Запрос;
	Запрос.Текст =                    	
	"ВЫБРАТЬ
	|	Имущество.Ссылка КАК ОсновноеСредство,
	|	Имущество.Код КАК ИнвНомер,
	|	Имущество.Наименование КАК Наименование,
	|	Имущество.Стоимость КАК Стоимость,
	|	Имущество.Состояние КАК Состояние,
	|	Имущество.НаличиеПоДаннымУчета КАК НаличиеПоДаннымУчета
	|ИЗ
	|	Справочник.Имущество КАК Имущество
	|ГДЕ
	|	Имущество.Помещение = &Помещение
	|	И Имущество.Состояние <> &Списанное
	|	И Имущество.Состояние <> &Утеряно";    
	
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("Списанное", Перечисления.Состояния.Списанное); 
	Запрос.УстановитьПараметр("Утеряно", Перечисления.Состояния.Утеряно); 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Данные = Новый Структура;
		Данные.Вставить("ОсновноеСредство",ВыборкаДетальныеЗаписи.ОсновноеСредство);
		Данные.Вставить("ИнвНомер",ВыборкаДетальныеЗаписи.ИнвНомер);
		Данные.Вставить("Наименование",ВыборкаДетальныеЗаписи.Наименование);
		Данные.Вставить("Стоимость",ВыборкаДетальныеЗаписи.Стоимость);   
		Данные.Вставить("Состояние",ВыборкаДетальныеЗаписи.Состояние); 
		Данные.Вставить("НаличиеПоДаннымУчета",ВыборкаДетальныеЗаписи.НаличиеПоДаннымУчета);
		МассивДанных.Добавить(Данные);
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)                                             
	Объект.Дата = ТекущаяДата();
	История = РегистрыСведений.УчетДвиженийИмущества.СоздатьНаборЗаписей();   
	НачатьТранзакцию();
	Для Каждого ТК Из ТекущийОбъект.ТабДокОснСредства Цикл
		ОсновноеСредство = ТК.ОсновноеСредство.ПолучитьОбъект();
		                                                  
		Если ТК.ФактическоеНаличие = ИСТИНА тогда
			ОсновноеСредство.Состояние = ТК.Состояние;
		Иначе 
			ОсновноеСредство.Состояние = Перечисления.Состояния.Утеряно;      
			ОсновноеСредство.НаличиеПоДаннымУчета = ТК.ФактическоеНаличие;
		КонецЕсли;
		ОсновноеСредство.Записать();
		
		История.Прочитать();
		ЗаписьИстории = История.Добавить();
		ЗаписьИстории.Период = Объект.ПериодПо;
		ЗаписьИстории.Имущество = ОсновноеСредство.Ссылка;
		ЗаписьИстории.ИнвНомер = ОсновноеСредство.Код;
		ЗаписьИстории.Помещение = ОсновноеСредство.Помещение; 
		ЗаписьИстории.Состояние = ОсновноеСредство.Состояние;  
		ЗаписьИстории.Комментарий = Объект.Комментарий; 
		История.Записать();
			
	КонецЦикла;
    ЗафиксироватьТранзакцию();
КонецПроцедуры
